young-whites/smart-fish-tank/stm32Code-official/MDK_APP/TimingSet.c
#include "TimingSet.h"
#include "MyTypedef.h"
#include "bsp_Key.h"
#include "ds18b20.h"
#include "bsp_beep.h"
#include "bsp_adc.h"
#include "stm32f10x_tim.h"

extern void OLED_Show_Page(uint8_t page);
extern void OLED_Clr_Screen(void);
extern void OLED_ShowStart(void);


static uint8_t _lastPage = 0xFF;


/* Servo angle: 0~180 degrees, maps to PWM duty 500~2500us (period 20ms=20000us) */
void Servo_SetAngle(uint8_t angle)
{
	uint16_t pulse;
	if (angle > 180) angle = 180;
	pulse = 500 + (uint16_t)((uint32_t)angle * 2000 / 180);
	TIM_SetCompare1(TIM3, pulse);
}


void Timing_1s(void)
{
	/* Manual relay safety timeout */
	if (Record.runMode == 1) {
		/* Check if any relay is ON */
		if (Flag.relayHeat || Flag.relayFill || Flag.relayDrain || Flag.relayOxygen) {
			if (Flag.manualTimeout > 0) {
				Flag.manualTimeout--;
			}
			if (Flag.manualTimeout == 0) {
				/* Timeout: turn off all relays */
				Flag.relayHeat = 0;
				Flag.relayFill = 0;
				Flag.relayDrain = 0;
				Flag.relayOxygen = 0;
				BEEP_Blink(3, 0, 2);  /* Beep 3 times to warn */
			}
		} else {
			/* No relay ON: reset timeout */
			Flag.manualTimeout = 60;
		}
	} else {
		/* Auto mode: reset timeout */
		Flag.manualTimeout = 60;
	}

	/* DS18B20 read moved to main loop to avoid ISR blocking */

	/* Feed control */
	{
		static uint8_t servoOpenSec = 0;  /* Seconds servo has been open */

		if (Flag.feeding == 1) {
			if (Record.feedCountdown > 0) {
				Record.feedCountdown--;
				if (servoOpenSec < 3) {
					/* First 3 seconds: servo open */
					Servo_SetAngle(90);
					servoOpenSec++;
				} else {
					/* After 3 seconds: servo close, wait for countdown */
					Servo_SetAngle(0);
				}
			}
			if (Record.feedCountdown == 0) {
				Flag.feeding = 0;
				Servo_SetAngle(0);
				servoOpenSec = 0;
			}
		} else {
			servoOpenSec = 0;
		}
	}
}



void Timing_1ms(void)
{
	KEY_DrvScan();
}



void Timing_2ms(void)
{

}



void Timing_5ms(void)
{
	/* ADC non-blocking polling: check EOC, skip if not ready */
	static uint8_t adcCh = 0;
	static uint8_t adcPending = 0;  /* 0=idle, 1=conversion started */

	if (!adcPending) {
		/* Start conversion for current channel */
		switch (adcCh) {
			case 0: ADC_RegularChannelConfig(ADC1, ADC_Channel_1, 1, ADC_SampleTime_55Cycles5); break;  /* Water level PA1 */
			case 1: ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_55Cycles5); break;  /* PH PA0 */
			case 2: ADC_RegularChannelConfig(ADC1, ADC_Channel_4, 1, ADC_SampleTime_55Cycles5); break;  /* Air quality PA4 */
		}
		ADC_SoftwareStartConvCmd(ADC1, ENABLE);
		adcPending = 1;
	} else {
		/* Check if conversion complete */
		if (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC)) {
			uint16_t val = ADC_GetConversionValue(ADC1);
			switch (adcCh) {
				case 0:
					Record.waterLevel = (uint8_t)(val * 100.0f / 4095.0f);
					if (Record.waterLevel > 100) Record.waterLevel = 100;
					break;
				case 1:
					Record.phValue = val * 14.0f / 4095.0f;
					if (Record.phValue > 14.0f) Record.phValue = 14.0f;
					if (Record.phValue < 0.0f) Record.phValue = 0.0f;
					break;
				case 2:
					Record.airQuality = val;
					break;
			}
			adcCh = (adcCh + 1) % 3;
			adcPending = 0;
		}
		/* If EOC not set, skip this cycle - will retry next 5ms */
	}
}



void Timing_10ms(void)
{

}



void Timing_50ms(void)
{
	KEY_Scan();
}



void Timing_500ms(void)
{
	/* --- Auto control (Auto mode only) --- */
	if (Record.runMode == 0) {
		/* Temperature hysteresis control */
		if (Record.waterTemp < Record.tempLower) {
			Flag.relayHeat = 1;
		} else if (Record.waterTemp > Record.tempUpper) {
			Flag.relayHeat = 0;
		}

		/* Water level range control */
		if (Record.waterLevel > Record.waterLevelMax) {
			Flag.relayDrain = 1;
			Flag.relayFill = 0;
		} else if (Record.waterLevel < Record.waterLevelMin) {
			Flag.relayFill = 1;
			Flag.relayDrain = 0;
		} else {
			Flag.relayFill = 0;
			Flag.relayDrain = 0;
		}

		/* Air quality control */
		if (Record.airQuality > Record.airQualityMax) {
			Flag.relayOxygen = 1;
		} else {
			Flag.relayOxygen = 0;
		}
	}

	/* --- Alarm check --- */
	{
		uint8_t alarm = 0;
		if (Record.waterTemp < Record.tempLower || Record.waterTemp > Record.tempUpper) alarm = 1;
		if (Record.waterLevel < Record.waterLevelMin || Record.waterLevel > Record.waterLevelMax) alarm = 1;
		if (Record.airQuality > Record.airQualityMax) alarm = 1;
		if (Record.phValue < Record.phLower || Record.phValue > Record.phUpper) alarm = 1;

		if (alarm && Flag.alarmEnable) {
			BEEP_Blink(1, 2, 100);
		} else {
			BEEP_Off();
		}
	}
}
